# Find and project USB drive mounts
DeviceEvents
| where ActionType == "UsbDriveMounted"
| extend LoggedOnUsers_=parse_json(AdditionalFields)['LoggedOnUsers'][0]
| extend Volume_=parse_json(AdditionalFields)['Volume']
| extend DriveLetter_=parse_json(AdditionalFields)['DriveLetter']
| extend ProductName_=parse_json(AdditionalFields)['ProductName']
| extend ProductRevision_=parse_json(AdditionalFields)['ProductRevision']
| extend SerialNumber_=parse_json(AdditionalFields)['SerialNumber']
| extend Manufacturer_=parse_json(AdditionalFields)['Manufacturer']
| project Timestamp, ActionType, DeviceName, LoggedOnUsers_, Volume_, DriveLetter_, ProductName_, ProductRevision_, SerialNumber_, Manufacturer_

# Get timestamp of most recent DeviceProcessEvent as a check-health
DeviceProcessEvents
| summarize arg_max(Timestamp, *) by DeviceName
| project Timestamp, DeviceName

# Get timestamp of most recent DeviceNetworkEvent as a network-health check
DeviceNetworkEvents
| summarize arg_max(Timestamp, *) by DeviceName
| project Timestamp, DeviceName




// Get all security assessment metrics from defenders TVM modules
DeviceTvmSecureConfigurationAssessment
| where Timestamp > ago(30d)
| where IsApplicable == 1
| join kind=inner DeviceTvmSecureConfigurationAssessmentKB on ConfigurationId
| extend IsCompliant = iff(IsCompliant == 1, 'Compliant', 'NotCompliant')
| summarize arg_max(Timestamp, *) by DeviceName, ConfigurationId
| summarize CompliantCount = countif(IsCompliant == 'Compliant'), NotCompliantCount = countif(IsCompliant == 'NotCompliant') by ConfigurationId, ConfigurationName
| extend TotalCount = CompliantCount + NotCompliantCount
| extend CompliantPercentage = round(100.0 * CompliantCount / TotalCount, 2)
| project ConfigurationId, ConfigurationName, CompliantCount, NotCompliantCount, CompliantPercentage
| sort by ConfigurationId

// Get all security assessment metrics from defenders TVM modules with Configuration Impact level
DeviceTvmSecureConfigurationAssessment
| where Timestamp > ago(30d)
| where IsApplicable == 1
| join kind=inner DeviceTvmSecureConfigurationAssessmentKB on ConfigurationId
| extend IsCompliant = iff(IsCompliant == 1, 'Compliant', 'NotCompliant')
| where ConfigurationImpact >= 8
| summarize arg_max(Timestamp, *) by DeviceName, ConfigurationId, ConfigurationImpact
| summarize CompliantCount = countif(IsCompliant == 'Compliant'), NotCompliantCount = countif(IsCompliant == 'NotCompliant') by ConfigurationId, ConfigurationName, ConfigurationImpact
| extend TotalCount = CompliantCount + NotCompliantCount
| extend CompliantPercentage = round(100.0 * CompliantCount / TotalCount, 2)
| project ConfigurationId, ConfigurationImpact, CompliantCount, NotCompliantCount, CompliantPercentage, ConfigurationName
| sort by ConfigurationImpact desc , CompliantPercentage desc


// Get all security assessment metrics from defenders TVM modules with Configuration Impact level
DeviceTvmSecureConfigurationAssessment
| where Timestamp > ago(30d)
| where IsApplicable == 1
| join kind=inner DeviceTvmSecureConfigurationAssessmentKB on ConfigurationId
| extend IsCompliant = iff(IsCompliant == 1, 'Compliant', 'NotCompliant')
| where ConfigurationImpact >= 8
| summarize arg_max(Timestamp, *) by DeviceName, ConfigurationId, ConfigurationImpact
| summarize CompliantCount = countif(IsCompliant == 'Compliant'), NotCompliantCount = countif(IsCompliant == 'NotCompliant') by ConfigurationId, ConfigurationName, ConfigurationImpact, OSPlatform
| extend TotalCount = CompliantCount + NotCompliantCount
| extend CompliantPercentage = round(100.0 * CompliantCount / TotalCount, 2)
| project ConfigurationId, ConfigurationImpact, CompliantCount, NotCompliantCount, CompliantPercentage, ConfigurationName, OSPlatform
| sort by ConfigurationImpact desc , CompliantPercentage desc





// Get all security assessment metrics from defenders TVM modules with Configuration Impact level
DeviceTvmSecureConfigurationAssessment
| where Timestamp > ago(30d)
| where IsApplicable == 1
| join kind=inner DeviceTvmSecureConfigurationAssessmentKB on ConfigurationId
| extend IsCompliant = iff(IsCompliant == 1, 'Compliant', 'NotCompliant')
| where ConfigurationImpact >= 8
| where ConfigurationId == 'scid-2030'
| summarize arg_max(Timestamp, *) by DeviceName, ConfigurationId, ConfigurationImpact
| summarize CompliantCount = countif(IsCompliant == 'Compliant'), NotCompliantCount = countif(IsCompliant == 'NotCompliant') by ConfigurationId, ConfigurationName, ConfigurationImpact
| extend TotalCount = CompliantCount + NotCompliantCount
| project ConfigurationId, ConfigurationName, ConfigurationImpact, Compliant = CompliantCount, NotCompliant = NotCompliantCount
| mvexpand Compliant, NotCompliant
| summarize Count = sum(iff(IsCompliant == 'Compliant', Compliant, NotCompliant)) by IsCompliant
| project IsCompliant, Count






// Get all security assessment metrics from defenders TVM modules with Configuration Impact level
DeviceTvmSecureConfigurationAssessment
| where Timestamp > ago(30d)
| where IsApplicable == 1
| join kind=inner DeviceTvmSecureConfigurationAssessmentKB on ConfigurationId
| extend IsCompliant = iff(IsCompliant == 1, 'Compliant', 'NotCompliant')
| where ConfigurationImpact >= 8
| where ConfigurationId == 'scid-2030'
| summarize arg_max(Timestamp, *) by DeviceName, ConfigurationId, ConfigurationImpact
| summarize CompliantCount = countif(IsCompliant == 'Compliant'), NotCompliantCount = countif(IsCompliant == 'NotCompliant') by ConfigurationId, ConfigurationName, ConfigurationImpact
| extend TotalCount = CompliantCount + NotCompliantCount
| project CompliantCount, NotCompliantCount
| extend CompliantLabel = 'Compliant', NotCompliantLabel = 'NotCompliant'
| union (project CompliantLabel as Label, CompliantCount as Count), (project NotCompliantLabel as Label, NotCompliantCount as Count)




let configurationIdWhitelist = dynamic(['scid-2070','scid-5007','scid-2072','scid-2071','scid-2073']);
DeviceTvmSecureConfigurationAssessment
| where Timestamp > ago(30d)
| where IsApplicable == 1
| join kind=inner DeviceTvmSecureConfigurationAssessmentKB on ConfigurationId
| extend IsCompliant = iff(IsCompliant == 1, 'Compliant', 'NotCompliant')
| where ConfigurationImpact >= 8
| summarize arg_max(Timestamp, *) by DeviceName, ConfigurationId, ConfigurationImpact
| summarize CompliantCount = countif(IsCompliant == 'Compliant'), NotCompliantCount = countif(IsCompliant == 'NotCompliant') by ConfigurationId, ConfigurationName, ConfigurationImpact
| extend TotalCount = CompliantCount + NotCompliantCount
| where ConfigurationId in (configurationIdWhitelist)
| project ConfigurationId, ConfigurationImpact, CompliantCount, NotCompliantCount, ConfigurationName
| sort by ConfigurationImpact desc






let configurationIdWhitelist = dynamic(['scid-2070','scid-5007','scid-2072','scid-2071','scid-2073']);
DeviceTvmSecureConfigurationAssessment
| where Timestamp > ago(30d)
| where IsApplicable == 1
| join kind=inner (DeviceTvmSecureConfigurationAssessmentKB) on ConfigurationId
| extend IsCompliant = iff(IsCompliant == 1, 'Compliant', 'NotCompliant')
| where ConfigurationImpact >= 8
| summarize arg_max(Timestamp, *) by DeviceName, ConfigurationId, ConfigurationImpact
| summarize CompliantCount = countif(IsCompliant == 'Compliant'), NotCompliantCount = countif(IsCompliant == 'NotCompliant') by ConfigurationId, ConfigurationName, ConfigurationImpact
| extend TotalCount = CompliantCount + NotCompliantCount
| where ConfigurationId in (configurationIdWhitelist)
| summarize TotalCompliant = sum(CompliantCount), TotalDevices = sum(TotalCount)
| extend CompliancePercentage = todouble(TotalCompliant) / todouble(TotalDevices) * 100
| project CompliancePercentage













let configurationIdWhitelist = dynamic(['scid-2070','scid-5007','scid-2072','scid-2071','scid-2073']);
DeviceTvmSecureConfigurationAssessment
| where Timestamp > ago(30d)
| where IsApplicable == 1
| join kind=inner (DeviceTvmSecureConfigurationAssessmentKB) on ConfigurationId
| extend IsCompliant = iff(IsCompliant == 1, 'Compliant', 'NotCompliant')
| where ConfigurationImpact >= 8
| summarize arg_max(Timestamp, *) by DeviceName, ConfigurationId, ConfigurationImpact
| summarize CompliantCount = countif(IsCompliant == 'Compliant'), NotCompliantCount = countif(IsCompliant == 'NotCompliant') by ConfigurationId, ConfigurationName, ConfigurationImpact
| extend TotalCount = CompliantCount + NotCompliantCount
| where ConfigurationId in (configurationIdWhitelist)
| summarize TotalCompliant = sum(CompliantCount), TotalDevices = sum(TotalCount)
| extend CompliancePercentage = todouble(TotalCompliant) / todouble(TotalDevices) * 100
| project CompliancePercentage, NonCompliancePercentage = 100 - CompliancePercentage
| extend Label = 'Compliance Status'
| project Label, CompliancePercentage, NonCompliancePercentage
| mvexpand CompliancePercentage, NonCompliancePercentage
| project Status = iff(CompliancePercentage != 0, 'Compliant', 'Non-Compliant'), Value = iff(CompliancePercentage != 0, CompliancePercentage, NonCompliancePercentage)
| render barchart





let configurationIdWhitelist = dynamic(['scid-2070','scid-5007','scid-2072','scid-2071','scid-2073']);
DeviceTvmSecureConfigurationAssessment
| where Timestamp > ago(30d)
| where IsApplicable == 1
| join kind=inner (DeviceTvmSecureConfigurationAssessmentKB) on ConfigurationId
| extend IsCompliant = iff(IsCompliant == 1, 'Compliant', 'NotCompliant')
| where ConfigurationImpact >= 8
| summarize arg_max(Timestamp, *) by DeviceName, ConfigurationId, ConfigurationImpact
| summarize CompliantCount = countif(IsCompliant == 'Compliant'), NotCompliantCount = countif(IsCompliant == 'NotCompliant') by ConfigurationId, ConfigurationName, ConfigurationImpact
| extend TotalCount = CompliantCount + NotCompliantCount
| where ConfigurationId in (configurationIdWhitelist)
| summarize TotalCompliant = sum(CompliantCount), TotalDevices = sum(TotalCount)
| extend CompliancePercentage = todouble(TotalCompliant) / todouble(TotalDevices) * 100
| project CompliancePercentage, NonCompliancePercentage = 100 - CompliancePercentage
| extend Label = 'Compliance Status'
| project Label, CompliancePercentage, NonCompliancePercentage
| mvexpand CompliancePercentage, NonCompliancePercentage
| project Status = iff(CompliancePercentage != 0, 'Compliant', 'Non-Compliant'), Value = iff(CompliancePercentage != 0, CompliancePercentage, NonCompliancePercentage)
| render piechart




let configurationIdWhitelist = dynamic(['scid-2070','scid-5007','scid-2072','scid-2071','scid-2073']);
DeviceTvmSecureConfigurationAssessment
| where Timestamp > ago(30d)
| where IsApplicable == 1
| join kind=inner (DeviceTvmSecureConfigurationAssessmentKB) on ConfigurationId
| extend IsCompliant = iff(IsCompliant == 1, 'Compliant', 'NotCompliant')
| where ConfigurationImpact >= 8
| summarize arg_max(Timestamp, *) by DeviceName, ConfigurationId, ConfigurationImpact
| summarize CompliantCount = countif(IsCompliant == 'Compliant'), NotCompliantCount = countif(IsCompliant == 'NotCompliant') by ConfigurationId, ConfigurationName, ConfigurationImpact
| extend TotalCount = CompliantCount + NotCompliantCount
| where ConfigurationId in (configurationIdWhitelist)
| summarize TotalCompliant = sum(CompliantCount), TotalDevices = sum(TotalCount)
| extend CompliancePercentage = todouble(TotalCompliant) / todouble(TotalDevices) * 100
| extend NonCompliancePercentage = 100 - CompliancePercentage
| project Status = dynamic(['Compliant', 'Non-Compliant']), Values = dynamic([CompliancePercentage, NonCompliancePercentage])
| mvexpand Status, Values
| project Status, Values
| render barchart




Syntax error
Error message
Expected: ]
How to resolve
Fix syntax errors in your query
Token
CompliancePercentage
Line
16
Position
79







let configurationIdWhitelist = dynamic(['scid-2070','scid-5007','scid-2072','scid-2071','scid-2073']);
DeviceTvmSecureConfigurationAssessment
| where Timestamp > ago(30d)
| where IsApplicable == 1
| join kind=inner (DeviceTvmSecureConfigurationAssessmentKB) on ConfigurationId
| extend IsCompliant = iff(IsCompliant == 1, 'Compliant', 'NotCompliant')
| where ConfigurationImpact >= 8
| summarize arg_max(Timestamp, *) by DeviceName, ConfigurationId, ConfigurationImpact
| summarize CompliantCount = countif(IsCompliant == 'Compliant'), NotCompliantCount = countif(IsCompliant == 'NotCompliant') by ConfigurationId, ConfigurationName, ConfigurationImpact
| extend TotalCount = CompliantCount + NotCompliantCount
| where ConfigurationId in (configurationIdWhitelist)
| summarize TotalCompliant = sum(CompliantCount), TotalDevices = sum(TotalCount)
| extend CompliancePercentage = todouble(TotalCompliant) / todouble(TotalDevices) * 100
| extend NonCompliancePercentage = 100 - CompliancePercentage
| project Status = dynamic(['Compliant', 'Non-Compliant']), Values = dynamic([CompliancePercentage, NonCompliancePercentage])
| mvexpand Status to typeof(string), Values to typeof(double)
| project Status, Values
| render barchart
